{
  "notifications": [
    {
      "id": "1",
      "title": "Уведомление 1",
      "description": "Произошло какое-то событие",
      "userId": "1"
    },
    {
      "id": "2",
      "title": "Уведомление 2",
      "description": "Произошло какое-то событие",
      "userId": "1"
    },
    {
      "id": "3",
      "title": "Уведомление 3",
      "description": "Произошло какое-то событие",
      "userId": "1"
    },
    {
      "id": "4",
      "title": "Уведомление 4",
      "description": "Произошло какое-то событие",
      "userId": "1"
    }
  ],
  "articles": [
    {
      "title": "Магическая битва 2",
      "subtitle": "Jujutsu Kaisen Season 2",
      "img": "https://img.yani.tv/posters/huge/1636667826.avif",
      "views": 0,
      "type": [
        "IT"
      ],
      "blocks": [
        {
          "id": "WnKNe00bGz",
          "type": "TEXT",
          "title": "Описаниe",
          "paragraphs": [
            "2006 год. Юджи Итадори только-только исполнилось четыре, а шестнадцатилетний Сатору Годжо на пару с Сугуру Гэто уже стали самыми сильными. Преподаватель Токийского колледжа магии поручает им двоим крайне важную миссию: в целости и сохранности доставить к мастеру Тэнгэну старшеклассницу по имени Рико Аманай. Девочка была избрана идеальным сосудом силы, и пришло время мастеру слиться с её физической оболочкой. Однако недоброжелатели не дремлют, и, чтобы помешать этому, обращаются к человеку по прозвищу Убийца магов. Кто же на самом деле этот Убийца? Получится ли у юных магов выполнить свою миссию? Обо всём этом мы узнаем во втором сезоне «Магической битвы»!\n\n"
          ]
        },
        {
          "id": "cPF9yZ8UGj",
          "type": "TEXT",
          "title": "",
          "paragraphs": [
            "Новый сезон начнётся с истории про прошлое двух сильнейших магов современности Годжо Сатору и Сугуру Гэто, а продолжится аркой в районе Сибуя в котором проклятья воплотят свой план."
          ]
        }
      ],
      "createdAt": "15.01.2024",
      "userId": "1",
      "id": "MssYnemwOU"
    },
    {
      "title": "Ван-Пис",
      "subtitle": "One Piece",
      "img": "https://img.yani.tv/posters/huge/1636670070.avif",
      "views": 0,
      "type": [
        "IT"
      ],
      "blocks": [
        {
          "id": "rZAOIvxDqT",
          "type": "TEXT",
          "title": "Описание",
          "paragraphs": [
            "Перед своей казнью легендарный пират Капитан Роджер открыл всему миру тайное место, где спрятал награбленные сокровища.\n\n\n\n"
          ]
        },
        {
          "id": "b4C72-CN_M",
          "type": "TEXT",
          "title": "",
          "paragraphs": [
            "Желающих разгадать загадку острова Гранд Лайн оказалось очень много и сотни смельчаков отправились попытать удачу в это проклятое место. Но никто из них даже представить себе не мог столько опасностей и злобных тварей встретит их на этом острове, затерянном в океане. Большинство энтузиастов так остались лежать там, а те, кому посчастливилось выбраться живыми с острова перестали находку клада считать осуществимой задачей. Но алчные и кровожадные пираты не из тех, кто побоится посетить Гранд Лайн."
          ]
        },
        {
          "id": "VNa1Qpqict",
          "type": "TEXT",
          "title": "",
          "paragraphs": [
            "Главным героем этой истории становится семнадцатилетний юноша Монки Д. Луффи, который одержим мечтой стать Королем пиратов, равным по могуществу самому покойному Роджеру. Собрав команду из таких же храбрых моряков, как и он сам, Монки отправляется в долгое плавание, чтобы раздобыть сокровища Роджера, которые помогут ему выполнить свою давнюю мечту. Но хватит ли юноше отваги и смекалки, чтобы преодолеть все расставленные хитроумным Роджером ловушки по всему Гранд Лайну или же он со своей командой присоединится к уже погибшим здесь искателям сокровищ?"
          ]
        }
      ],
      "createdAt": "15.01.2024",
      "userId": "1",
      "id": "fHpDnp0mcj"
    },
    {
      "title": "Хантер х Хантер",
      "subtitle": "Hunter x Hunter",
      "img": "https://img.yani.tv/posters/huge/1636667315.avif",
      "views": 0,
      "type": [
        "IT"
      ],
      "blocks": [
        {
          "id": "Amcx7MvxzP",
          "type": "TEXT",
          "title": "Описание",
          "paragraphs": [
            "Ремейк аниме-сериала «Охотник х Охотник» 1999 года."
          ]
        },
        {
          "id": "N5mn1CNaP8",
          "type": "TEXT",
          "title": "",
          "paragraphs": [
            "Охотник — это тот, кто путешествует по миру, выполняя различные опасные миссии: от поимки преступников до поисков сокровищ в неизведанных землях. Главный герой — мальчик по имени Гон. Его отец, Джин, был охотником, но исчез много лет назад. Гон считает, что если пойдёт по стопам отца и станет охотником, то рано или поздно вновь встретится с ним. Мальчик надеется, что, повстречав отца, наконец сможет задать ему один-единственный вопрос: почему он предпочёл жизнь охотника своему маленькому сынишке."
          ]
        },
        {
          "id": "wXtuJb-Fcx",
          "type": "TEXT",
          "title": "",
          "paragraphs": [
            "Когда ему исполняется двенадцать, Гон, как в своё время и его отец, покидает родной остров с целью сдать официальный экзамен на охотника. Но экзамен очень сложен, и каждый год множество людей погибают, пытаясь получить это звание. Во время своего путешествия Гон знакомится с Курапикой, Леорио и Киллуа, вместе с которыми ступает на тернистый путь охотника."
          ]
        }
      ],
      "id": "EnsgBprPi9",
      "createdAt": "15.01.2024",
      "userId": "1"
    },
    {
      "title": "Тетрадь смерти",
      "subtitle": "Death Note",
      "img": "https://img.yani.tv/posters/huge/1636667316.avif",
      "views": 0,
      "type": [
        "IT"
      ],
      "blocks": [
        {
          "id": "49U8_mp9NO",
          "type": "TEXT",
          "title": "Описание",
          "paragraphs": [
            "Уставший от ухудшающегося мира и от немногословиях своих собратьев, синигами Рюук отправляет на Землю Тетрадь Смерти, наблюдая за тем, что же интересное из этого получится. Его план начинает исполняться, когда Тетрадь Смерти поднимает гениальный ученик старшей школы Лайт Ягами, которому так же наскучил окружающий его мир. Изначально Лайт рассматривал рукопись как чью-то неудавшуюся шутку, но вскоре, экспериментальным путем Лайт открывает правду, написанную в Тетради Смерти. Нужно всего лишь создать изображение человека у себя в уме в тот момент, когда он пишет его имя в Тетради Смерти, и тогда, этот человек умрет через 40 секунд от сердечного приступа. Вооружившись такой невиданной силой, Лайт становится неуловимым убийцей, и он решает сделать этот мир лучше, истребляя криминальных авторитетов и преступников с помощью Тетради Смерти. Вскоре, в интернете и СМИ появляются новости о таинственном \"Кира\", который пытается играть в бога."
          ]
        },
        {
          "id": "1jmjbuEQZV",
          "type": "TEXT",
          "title": "",
          "paragraphs": [
            "За расследование серии странных убийств, берется загадочный детектив L, который сделает все чтобы остановить Киру. Лайт старается сделать все, что от него зависит, ради того чтобы люди не раскрыли его личность, даже если это будет означать убийство невинных, которые могут помочь расследованию."
          ]
        }
      ],
      "id": "nJ38-0ksm1",
      "createdAt": "15.01.2024",
      "userId": "1"
    },
    {
      "title": "Необъятный океан",
      "subtitle": "Grand Blue",
      "img": "https://img.yani.tv/posters/huge/1636667317.avif",
      "views": 0,
      "type": [
        "IT"
      ],
      "blocks": [
        {
          "id": "m_hS0ZGwxY",
          "type": "TEXT",
          "title": "Описание",
          "paragraphs": [
            "Иори Китахара поступил в университет в прибрежном городке и снял комнату у семьи Котэгава. Глава семьи владеет магазинчиком снаряжения для дайвинга, но эта тематика не близка сердцу Иори - он до ужаса боится воды. Но знакомство с компанией друзей-дайверов заставляет его постепенно менять свои взгляды, научиться смотреть своим страхам прямо в глаза и открыть для себя просторы необъятного океана."
          ]
        }
      ],
      "id": "Ol2wBjuGwZ",
      "createdAt": "15.01.2024",
      "userId": "1"
    },
    {
      "title": "Врата Штейна",
      "subtitle": "Steins Gate",
      "img": "https://img.yani.tv/posters/huge/1595874954.avif",
      "views": 0,
      "type": [
        "IT"
      ],
      "blocks": [
        {
          "id": "YNGquGEmO5",
          "type": "TEXT",
          "title": "Описание",
          "paragraphs": [
            "Акихабара – интереснейшее место, где обитают самые разные люди – от слегка сдвинутых по фазе до больных на всю голову. Именно такая компания собралась в \"Лаборатории Гаджетов Будущего\", что над лавкой старых телевизоров. Возглавляет её 18-летний Ринтаро Окабэ, сумасшедший ученый и борец с мировым заговором. В серьезном деле нельзя без хакера – вот и он, Хашида Итару (Дару), конечно же, толстяк и истинный отаку. Добрая фея лаборатории – Шиина Маюри (Маюши), подруга детства Ринтаро, официантка мейд-кафе и фанатка косплея, а научную мощь бригады резко повысила юный гений Макисэ Курису, истосковавшаяся по интеллектуальным приключениям и простому человеческому теплу."
          ]
        },
        {
          "id": "Wc3mBulD6j",
          "type": "TEXT",
          "title": "",
          "paragraphs": [
            "Компании удалось построить машину времени из микроволновки и барахла с ближайшей распродажи. Великие открытия делают любители, а профессионалы строят «Титаники». Вот только потом началось такое, что парадокс дедушки нервно удалился курить в сторонку, а главный герой трижды проклял тот день, когда сдуру открыл врата Штейна. Он был готов рисковать своей жизнью, но не чужими. Впрочем, сделанного, как известно, не воротишь. Или… все же можно?"
          ]
        }
      ],
      "id": "r7TlesbYiT",
      "createdAt": "15.01.2024",
      "userId": "1"
    },
    {
      "title": "Ванпанчмен",
      "subtitle": "One Punch Man",
      "img": "https://img.yani.tv/posters/huge/1636667319.avif",
      "views": 0,
      "type": [
        "IT"
      ],
      "blocks": [
        {
          "id": "aBow--TvZZ",
          "type": "TEXT",
          "title": "Описание",
          "paragraphs": [
            "Вы устали от запоминания суператак и бесконечных доспехов, но душа просит адреналина и драк? Тогда эта новая экшен-комедия от студии Madhouse для вас!"
          ]
        },
        {
          "id": "Y6ZbVcDqT5",
          "type": "TEXT",
          "title": "",
          "paragraphs": [
            "Главный герой не размахивает мечом, не выкрикивает боевой клич и вообще не отличается ничем, особенно героическим. Всё в этом молодом человеке по имени Сайтама так и вопит: «заурядный» — и его лысая голова, и его хилое телосложение. Однако у этого среднестатистического по всем параметрам парня совсем не среднестатистические проблемы... Потому что на самом деле он — супергерой, жаждущий битвы с суперкрутыми противниками. Загвоздка в том, что, отыскав наконец перспективного кандидата на роль главного врага, Сайтама выносит его с одного удара. Сможет ли Сайтама заиметь себе могучего злодея, который смог бы достойно противостоять ему? Следите за Ванпанчменом в его уморительных приключениях, пока среди многочисленных плохих парней он, несмотря ни на что, будет пытаться найти «своего»!"
          ]
        }
      ],
      "id": "EEMj_igm21",
      "createdAt": "15.01.2024",
      "userId": "1"
    },
    {
      "title": "Реинкарнация безработного",
      "subtitle": "Mushoku Tensei",
      "img": "https://img.yani.tv/posters/huge/1636026766.avif",
      "views": 0,
      "type": [
        "IT"
      ],
      "blocks": [
        {
          "id": "5DQMjbjesj",
          "type": "TEXT",
          "title": "Описание",
          "paragraphs": [
            "После переноса главного героя и его ученицы в далекие земли, герои нашли спутника, который пообещал их привести обратно в их родные края. Продолжение истории первого сезона, о сложном путешествии домой и очистки имени \"Дед Энда\"."
          ]
        }
      ],
      "createdAt": "15.01.2024",
      "userId": "1",
      "id": "Em-3LNKNVQ"
    },
    {
      "title": "Код Гиасс",
      "subtitle": "Code Geass",
      "img": "https://img.yani.tv/posters/huge/1613122367.avif",
      "views": 0,
      "type": [
        "IT"
      ],
      "blocks": [
        {
          "id": "0LtG-9lbAM",
          "type": "TEXT",
          "title": "Описание",
          "paragraphs": [
            "Альтернативная реальность: Британская империя захватила треть мира, обрушивая на непокорных мощь своей военной машины."
          ]
        },
        {
          "id": "M2T-5UZM8U",
          "type": "TEXT",
          "title": "",
          "paragraphs": [
            "В Японии, захваченной и переименованной в Зону 11, вместе с младшей сестрой живёт старшеклассник Лелуш – изгнанный сын Императора, потерявший мать и право на престол. Юноша отличается от сверстников не только происхождением – он весьма одарённая личность, только где применить эти способности? Неожиданно Лелуш оказывается вовлечён в столкновение между японскими террористами и британскими солдатами. Так он знакомится с загадочной девушкой C.C. Она дарует ему сверхъестественную способность Гиас, позволяющую подчинять себе волю других людей."
          ]
        },
        {
          "id": "2E5xUVKuFp",
          "type": "TEXT",
          "title": "",
          "paragraphs": [
            "Скрывая лицо под маской и под именем Зеро, Лелуш присоединяется к подпольному движению, горя желанием отомстить Британии и отцу. Будучи студентом Академии Ашфорд, юноша вынужден вести двойную жизнь."
          ]
        }
      ],
      "createdAt": "15.01.2024",
      "userId": "1",
      "id": "MuTKLYKJP3"
    },
    {
      "title": "Вайолет Эвергарден",
      "subtitle": "Violet Evergarden",
      "img": "https://img.yani.tv/posters/huge/1636669332.avif",
      "views": 0,
      "type": [
        "IT"
      ],
      "blocks": [
        {
          "id": "wlbRjNPXks",
          "type": "TEXT",
          "title": "Описание",
          "paragraphs": [
            "Вайолет Эвергарден, молодая девушка, чья жизнь — не что иное, как война, послушно служит под командованием майора Гилберта Бугенвиллеи из армии Ляйденшафтлиха.;"
          ]
        },
        {
          "id": "d7dZk8eOsd",
          "type": "TEXT",
          "title": "",
          "paragraphs": [
            "После серьёзных увечий, оставивших её без рук и разделивших с Гилбертом, она покинула поле боя и была взята под опеку бывшим командующим армии Клаудией Ходжинсом, который после окончания войны основал почтовую службу «C-H» в крупном портовом городе Ляйден. Эта компания осуществляет регулярные почтовые пересылки и предоставляет услуги «автозапоминающих кукол» — талантливых девушек, в чьи обязанности входит написание писем и корректировка текста для большей части неграмотного населения города."
          ]
        },
        {
          "id": "iiumahihWJ",
          "type": "TEXT",
          "title": "",
          "paragraphs": [
            "В конечном итоге, тронутая работой автозапоминающих кукол, Вайолет решает присоединиться к команде, чтобы узнать судьбу майора Гилберта и смысл последних слов, сказанных им: «Я люблю тебя»."
          ]
        }
      ],
      "id": "jA8l0pIGvA",
      "createdAt": "15.01.2024",
      "userId": "1"
    },
    {
      "title": "Гуррен-Лаганн",
      "subtitle": "Heavenly Breakthrough Gurren Lagann",
      "img": "https://img.yani.tv/posters/huge/1570881881.avif",
      "views": 0,
      "type": [
        "IT"
      ],
      "blocks": [
        {
          "id": "G9LWuQg2Gu",
          "type": "TEXT",
          "title": "Описание",
          "paragraphs": [
            "Более тысячи лет люди живут в пещерах под землей, постоянно опасаясь землетрясений и обвалов. Они постоянно бурят и таким образом живут. Симон, один из лучших бурильщиков, и его неординарный друг Камина жили в такой пещерной деревне. Камина был убежден, что существует другой, намного лучший, мир. И этот мир находится наверху. Но его надежды пока оставались без ответа. Однажды Симон находит \"ключ\" и небольшого робота. На следующий день после землетрясения потолок пещеры обрушился... Так начались удивительные приключения Камины и Симона в мире под открытым небом."
          ]
        }
      ],
      "id": "-Ee7kpTNvd",
      "createdAt": "15.01.2024",
      "userId": "1"
    },
    {
      "title": "",
      "subtitle": "Bleach",
      "img": "https://img.yani.tv/posters/huge/1636667421.avif",
      "views": 0,
      "type": [
        "IT"
      ],
      "blocks": [
        {
          "id": "KmqXK36sPv",
          "type": "TEXT",
          "title": "Описание",
          "paragraphs": [
            "Куросаки Итиго — не простой пятнадцатилетний парень, потому как, сколько он себя помнил, всегда мог запросто общаться с духами и призраками, невидимыми для обычных людей. В один судьбоносный день ему является сама синигами (богиня смерти) Кутики Рукиа, охотящаяся за Пустым (злым духом, пожирающим души людей). Во время битвы с этим чудовищем Итиго и Рукиа получили серьёзные ранения, и богине пришлось передать парню свои силы, чтобы помочь ему одержать победу над монстром, в результате чего Итиго сам стал синигами! Но сделав это, Рукиа теряет всю свою мощь, и теперь ожидает, что новоявленный синигами продолжит её миссию по отлову и уничтожению Пустых. Так начинаются увлекательные приключения Итиго и Рукии."
          ]
        }
      ],
      "createdAt": "15.01.2024",
      "userId": "1",
      "id": "DvPWSbzRYF"
    },
    {
      "title": "Обещанный Неверленд",
      "subtitle": "The Promised Neverland",
      "img": "https://img.yani.tv/posters/huge/1545582374.avif",
      "views": 0,
      "type": [
        "IT"
      ],
      "blocks": [
        {
          "id": "6wCcAhzw-C",
          "type": "TEXT",
          "title": "Описание",
          "paragraphs": [
            "В сиротском приюте «Благодатный дом» под чутким взором «Матери» живут трое подростков — Эмма, Норман и Рэй. Окружённые младшими братьями и сёстрами они не знают бед и невзгод. Но в одну ночь их идиллия оборачивается кошмаром. Они считали приют раем. Но теперь, когда они знают правду, у них остался один выход: сбежать или... умереть!"
          ]
        }
      ],
      "id": "YTYQZiGZ83",
      "createdAt": "15.01.2024",
      "userId": "1"
    }
  ],
  "comments": [],
  "profile": [
    {
      "id": "1",
      "firstname": "Kamushek",
      "avatar": "https://i.pinimg.com/236x/e3/31/59/e3315992e8f8ba73900ca0f0c2aac38f.jpg",
      "lastname": "RinkaLove",
      "age": 24,
      "currency": "USD",
      "country": "USA",
      "city": "Kyoto",
      "username": "adm",
      "userId": "1",
      "user": {
        "id": "1",
        "username": "admin",
        "password": "0u2vbn",
        "avatar": "https://pokemongohub.net/wp-content/uploads/2023/06/grunts-1-768x432.jpg.webp",
        "roles": [
          "admin",
          "manager"
        ],
        "features": {
          "isArticleRatingEnabled": true,
          "isAppRedesigned": true
        },
        "jsonSettings": {
          "theme": "app_dark_theme",
          "isArticlesPageOpened": true
        }
      }
    },
    {
      "id": "yoxuauf",
      "firstname": "Rinka",
      "lastname": "Shikima",
      "age": 18,
      "currency": "USD",
      "country": "USA",
      "city": "Almaty",
      "username": "Rinka",
      "avatar": "https://i.pinimg.com/564x/1c/b4/b4/1cb4b450ea6d663602fd2c012de9fda5.jpg",
      "userId": "JPn_5xM",
      "user": {
        "id": "JPn_5xM",
        "username": "Rinka",
        "password": "12345",
        "roles": [
          "user"
        ],
        "features": {
          "isArticleRatingEnabled": false
        },
        "jsonSettings": {
          "theme": "app_light_theme",
          "isArticlesPageOpened": false
        }
      }
    }
  ],
  "users": [
    {
      "id": "1",
      "username": "admin",
      "password": "0u2vbn",
      "avatar": "https://pokemongohub.net/wp-content/uploads/2023/06/grunts-1-768x432.jpg.webp",
      "roles": [
        "admin",
        "manager"
      ],
      "features": {
        "isArticleRatingEnabled": true,
        "isAppRedesigned": true
      },
      "jsonSettings": {
        "theme": "app_dark_theme",
        "isArticlesPageOpened": true
      }
    },
    {
      "id": "JPn_5xM",
      "username": "Rinka",
      "password": "12345",
      "avatar": "https://i.pinimg.com/564x/1c/b4/b4/1cb4b450ea6d663602fd2c012de9fda5.jpg",
      "roles": [
        "user"
      ],
      "features": {
        "isArticleRatingEnabled": true
      },
      "jsonSettings": {
        "theme": "app_dark_theme",
        "isArticlesPageOpened": true
      }
    }
  ],
  "article-ratings": [],
  "profile-ratings": [
    {
      "userId": "1",
      "feedback": "агрессивный",
      "starRate": 1,
      "id": 1
    }
  ]
}